ekkus93/esp32-macro-keyboard/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256

# The ESP-IDF default (3584 bytes) overflows main_task during provisioned
# startup: start_normal_mode() -> storage_recover() descends through
# storage_transaction_recover_restores_with_ops() -> posix_open_directory()
# -> esp_vfs_opendir() -> vfs_littlefs_opendir(), and LittleFS directory
# opening is stack-hungry. Observed on real ESP32-S3 hardware as a
# boot-loop: "Guru Meditation Error: Core 0 panic'ed (Double exception)"
# immediately after "stage complete: storage_mount", with a backtrace
# ending in _xt_context_save. Only reachable once the device is actually
# provisioned (setup mode skips storage recovery entirely), which is why
# it went unseen until first real provisioning.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
